inlet_r96_PIMPLE/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            pressureGradientExplicitSource;
    active          on;
    selectionMode   all;
    pressureGradientExplicitSourceCoeffs
    {
        fieldNames  (U);
        Ubar        (49.6 0 0);
        gradPini    gradPini [0 2 -2 0 0] 0;
        flowDir     (1 0 0);
    }
}
// ************************************************************************* //

